{
  "alpha_pattern": {},
  "auto_mapping": null,
  "base_model_name_or_path": "nsi319/legal-led-base-16384",
  "bias": "none",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layer_replication": null,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 32,
  "lora_dropout": 0.1,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 4,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "led.encoder.layers.4.self_attn.longformer_self_attn.key",
    "led.decoder.layers.1.encoder_attn.k_proj",
    "led.decoder.layers.1.self_attn.v_proj",
    "led.decoder.layers.2.self_attn.k_proj",
    "led.encoder.layers.1.self_attn.longformer_self_attn.key",
    "led.encoder.layers.2.self_attn.longformer_self_attn.value",
    "led.encoder.layers.0.self_attn.longformer_self_attn.query",
    "led.decoder.layers.5.encoder_attn.k_proj",
    "led.encoder.layers.5.self_attn.longformer_self_attn.query",
    "led.decoder.layers.5.self_attn.v_proj",
    "led.encoder.layers.3.self_attn.longformer_self_attn.key",
    "led.decoder.layers.3.encoder_attn.q_proj",
    "led.decoder.layers.2.encoder_attn.v_proj",
    "led.encoder.layers.0.self_attn.longformer_self_attn.value",
    "led.decoder.layers.2.self_attn.q_proj",
    "led.encoder.layers.1.self_attn.longformer_self_attn.query",
    "led.decoder.layers.3.self_attn.q_proj",
    "led.decoder.layers.5.encoder_attn.v_proj",
    "led.decoder.layers.4.self_attn.k_proj",
    "led.decoder.layers.1.self_attn.q_proj",
    "led.encoder.layers.1.self_attn.longformer_self_attn.value",
    "led.encoder.layers.3.self_attn.longformer_self_attn.query",
    "led.encoder.layers.0.self_attn.longformer_self_attn.key",
    "led.encoder.layers.4.self_attn.longformer_self_attn.query",
    "led.decoder.layers.0.self_attn.k_proj",
    "led.decoder.layers.2.self_attn.v_proj",
    "led.decoder.layers.0.self_attn.v_proj",
    "led.encoder.layers.3.self_attn.longformer_self_attn.value",
    "led.encoder.layers.5.self_attn.longformer_self_attn.value",
    "led.decoder.layers.4.encoder_attn.k_proj",
    "led.decoder.layers.5.encoder_attn.q_proj",
    "led.decoder.layers.0.encoder_attn.v_proj",
    "led.encoder.layers.2.self_attn.longformer_self_attn.query",
    "led.decoder.layers.0.self_attn.q_proj",
    "led.decoder.layers.3.self_attn.k_proj",
    "led.decoder.layers.0.encoder_attn.q_proj",
    "led.decoder.layers.3.self_attn.v_proj",
    "led.decoder.layers.4.encoder_attn.q_proj",
    "led.decoder.layers.2.encoder_attn.k_proj",
    "led.encoder.layers.4.self_attn.longformer_self_attn.value",
    "led.decoder.layers.1.self_attn.k_proj",
    "led.decoder.layers.1.encoder_attn.q_proj",
    "led.decoder.layers.4.self_attn.q_proj",
    "led.decoder.layers.4.encoder_attn.v_proj",
    "led.decoder.layers.1.encoder_attn.v_proj",
    "led.decoder.layers.4.self_attn.v_proj",
    "led.decoder.layers.5.self_attn.q_proj",
    "led.encoder.layers.2.self_attn.longformer_self_attn.key",
    "led.decoder.layers.2.encoder_attn.q_proj",
    "led.decoder.layers.5.self_attn.k_proj",
    "led.decoder.layers.3.encoder_attn.v_proj",
    "led.encoder.layers.5.self_attn.longformer_self_attn.key",
    "led.decoder.layers.3.encoder_attn.k_proj",
    "led.decoder.layers.0.encoder_attn.k_proj"
  ],
  "task_type": "SUMMARIZATION",
  "use_dora": false,
  "use_rslora": false
}